# MacroManager Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManager Class
Members See Also
---
Manager object for the Macro modules of the application.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class MacroManager : IEnumerable<MacroModule>,
	IDisposable
```

Visual Basic
---
```text
Public Class MacroManager _
	Implements IEnumerable(Of MacroModule), IDisposable
```

Visual C++
---
```text
public ref class MacroManager : IEnumerable<MacroModule^>,
	IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Macros..::..MacroManager
# See Also
MacroManager Members
Autodesk.Revit.DB.Macros Namespace